solo_riblet/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../constants.dat"
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        // type            fixedFluxPressure;
        // value           uniform 0;
        //type            zeroGradient;

        type             zeroGradient;
    }

    rightWall
    {
        // type            fixedFluxPressure;
        // value           uniform 0;

        //type            zeroGradient;
        type             fixedValue;
        value               uniform 0;
    }

    lowerWall
    {
        // type            fixedFluxPressure;
        // value           uniform 0;
        type            zeroGradient;
    }

    atmosphere
    {
        type            zeroGradient;
        // type               fixedValue;
        // value              uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
