solo_riblet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;
RHS_x 500; //the RHS x co-ord of the system.  for the solo riblet testing phase it had a value of 6.485
vertices
(
  (0.000  0.000  0.000)	 //vertex 0
	(55.200  0.000  0.000)	 //vertex 1
	(92.000  0.000  0.000)	 //vertex 2
	(124.245  0.000  0.000)	 //vertex 3
	(161.045  0.000  0.000)	 //vertex 4
	($RHS_x  0.000  0.000)	 //vertex 5
	(0.000  42.000  0.000)	 //vertex 6
	(55.200  42.000  0.000)	 //vertex 7
	(108.122  42.000  0.000)	 //vertex 8
	(161.045  42.000  0.000)	 //vertex 9
	($RHS_x  42.000  0.000)	 //vertex 10
	(0.000  200.000  0.000)	 //vertex 11
	(55.200  200.000  0.000)	 //vertex 12
	(108.122  200.000  0.000)	 //vertex 13
	(161.045  200.000  0.000)	 //vertex 14
	($RHS_x  200.000  0.000)	 //vertex 15
	(0.000  0.000  0.100)	 //vertex 16
	(55.200  0.000  0.100)	 //vertex 17
	(92.000  0.000  0.100)	 //vertex 18
	(124.245  0.000  0.100)	 //vertex 19
	(161.045  0.000  0.100)	 //vertex 20
	($RHS_x  0.000  0.100)	 //vertex 21
	(0.000  42.000  0.100)	 //vertex 22
	(55.200  42.000  0.100)	 //vertex 23
	(108.122  42.000  0.100)	 //vertex 24
	(161.045  42.000  0.100)	 //vertex 25
	($RHS_x  42.000  0.100)	 //vertex 26
	(0.000  200.000  0.100)	 //vertex 27
	(55.200  200.000  0.100)	 //vertex 28
	(108.122  200.000  0.100)	 //vertex 29
	(161.045  200.000  0.100)	 //vertex 30
	($RHS_x  200.000  0.100)	 //vertex 31

  // (0.000  0.000  0.000)	 //vertex 0
  // 	(0.006  0.000  0.000)	 //vertex 1
  // 	(0.010  0.000  0.000)	 //vertex 2
  // 	(0.057  0.000  0.000)	 //vertex 3
  // 	(0.061  0.000  0.000)	 //vertex 4
  // 	($RHS_x  0.000  0.000)	 //vertex 5
  // 	(0.000  0.100  0.000)	 //vertex 6
  // 	(0.006  0.100  0.000)	 //vertex 7
  // 	(0.034  0.100  0.000)	 //vertex 8
  // 	(0.061  0.100  0.000)	 //vertex 9
  // 	($RHS_x  0.100  0.000)	 //vertex 10
  // 	(0.000  0.500  0.000)	 //vertex 11
  // 	(0.006  0.500  0.000)	 //vertex 12
  // 	(0.034  0.500  0.000)	 //vertex 13
  // 	(0.061  0.500  0.000)	 //vertex 14
  // 	($RHS_x  0.500  0.000)	 //vertex 15
  // 	(0.000  0.000  0.100)	 //vertex 16
  // 	(0.006  0.000  0.100)	 //vertex 17
  // 	(0.010  0.000  0.100)	 //vertex 18
  // 	(0.057  0.000  0.100)	 //vertex 19
  // 	(0.061  0.000  0.100)	 //vertex 20
  // 	($RHS_x  0.000  0.100)	 //vertex 21
  // 	(0.000  0.100  0.100)	 //vertex 22
  // 	(0.006  0.100  0.100)	 //vertex 23
  // 	(0.034  0.100  0.100)	 //vertex 24
  // 	(0.061  0.100  0.100)	 //vertex 25
  // 	($RHS_x  0.100  0.100)	 //vertex 26
  // 	(0.000  0.500  0.100)	 //vertex 27
  // 	(0.006  0.500  0.100)	 //vertex 28
  // 	(0.034  0.500  0.100)	 //vertex 29
  // 	(0.061  0.500  0.100)	 //vertex 30
  // 	($RHS_x 0.500  0.100)	 //vertex 31

);

ribletX_nC 32; //the no. of x-cells in the blocks on/above the riblets
plateauX_nC 32; //the no. of x-cells in the blocks on/above the space between riblets

surfaceY_nC 32; //the no. of y-cells in the blocks on the surface
fluidY_nC 32; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)


blocks
(
    hex (0 1 7 6 16 17 23 22) ($plateauX_nC $surfaceY_nC 1) simpleGrading (1 1 1) //block 0
    hex (1 2 8 7 17 18 24 23) ($ribletX_nC $surfaceY_nC 1) simpleGrading (1 1 1) //block 1
    hex (3 4 9 8 19 20 25 24) ($ribletX_nC $surfaceY_nC 1) simpleGrading (1 1 1) //block 2
    hex (4 5 10 9 20 21 26 25) ($plateauX_nC $surfaceY_nC 1) simpleGrading (1 1 1) //block 3

    hex (6 7 12 11 22 23 28 27) ($plateauX_nC $fluidY_nC 1) simpleGrading (1 1 1) //block 4
    hex (7 8 13 12 23 24 29 28) ($ribletX_nC $fluidY_nC 1) simpleGrading (1 1 1) //block 5
    hex (8 9 14 13 24 25 30 29) ($ribletX_nC $fluidY_nC 1) simpleGrading (1 1 1) //block 6
    hex (9 10 15 14 25 26 31 30) ($plateauX_nC $fluidY_nC 1) simpleGrading (1 1 1) //block 7
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 6 22 16)
            (6 11 27 22)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (21 26 10 5)
            (26 31 15 10)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 24 8)
            (8 24 19 3)
            (3 19 20 4)
            (4 20 21 5)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
          (11 12 28 27)
          (12 13 29 28)
          (13 14 30 29)
          (14 15 31 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
